In [62]:

#  Banco de Dados: hrveo

import sqlite3
import pandas as pd

In [63]:

#  Cria o banco de dados em memória

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [64]:

cursor.execute('''
CREATE TABLE funcionarios (
    id_funcionario INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT,
    cargo TEXT,
    departamento TEXT,
    salario DECIMAL(10,2),
    data_contratacao DATE,
    cargo_confianca BOOLEAN
);
''')

In [65]:
dados = [
    ('Alec do Nascimento', 'Técnico', 'Jurídico', 3000.00, '2023-03-16', False),
    ('Arthur Assis', 'Analista', 'Jurídico', 5000.00, '2020-04-19', False),
    ('Caio Cesar', 'Técnico', 'Financeiro', 3000.00, '2021-10-01', False),
    ('Daniel da Silva', 'Analista', 'Financeiro', 5000.00, '2022-12-26', False),
    ('Davi de Oliveira', 'Analista', 'TI', 5000.00, '2022-09-23', False),
    ('Gabriel Maia', 'Técnico', 'Financeiro', 3000.00, '2023-12-19', False),
    ('Gabriel Cavalcante', 'Analista', 'TI', 5000.00, '2020-05-09', False),
    ('Igor Cruz', 'Técnico', 'Financeiro', 3000.00, '2024-01-14', False),
    ('João David Castro', 'Coordenador', 'TI', 6000.00, '2024-01-07', True),
    ('João Miguel da Silva', 'Gerente', 'Jurídico', 7500.00, '2021-05-19', True),
    ('João Paulo de Abreu', 'CFO', 'Financeiro', 15000.00, '2021-12-21', True),
    ('Jorge Henrique da Silva', 'Diretor', 'Financeiro', 8500.00, '2022-01-12', True),
    ('Júlia Pereira Santos', 'Analista', 'Jurídico', 5000.00, '2020-10-03', False),
    ('Karoline de Oliveira', 'Técnico', 'Jurídico', 3000.00, '2023-03-15', False),
    ('Kauã Correia', 'Analista', 'Jurídico', 5000.00, '2020-09-09', False),
    ('Kauan Torres', 'Técnico', 'TI', 3000.00, '2020-09-03', False),
    ('Lara Pessanha', 'Analista', 'TI', 5000.00, '2021-11-01', False),
    ('Laura Santos', 'Técnico', 'TI', 3000.00, '2022-09-01', False),
    ('Lauro Andrade', 'CEO', 'Executivo', 30000.00, '2022-08-04', True),
    ('Matheus da Silva', 'Analista', 'Financeiro', 5000.00, '2020-03-22', False),
    ('Miguel Chaves', 'Técnico', 'Financeiro', 3000.00, '2022-04-06', False),
    ('Nicollas Theodoro', 'Técnico', 'TI', 3000.00, '2022-04-11', False),
    ('Pedro Henrique Santos', 'Técnico', 'TI', 3000.00, '2021-06-04', False),
    ('Rayssa da Silva', 'Diretor', 'TI', 8500.00, '2021-04-07', True),
    ('Rebeca Alves', 'Analista', 'TI', 5000.00, '2022-11-29', False),
    ('Tábatha Tavares', 'Técnico', 'TI', 3000.00, '2021-03-21', False),
    ('Vinicius Araujo', 'Analista', 'TI', 5000.00, '2023-08-07', False),
    ('Yan Tavares', 'Técnico', 'TI', 3000.00, '2023-06-16', False)
]

cursor.executemany('''
INSERT INTO funcionarios (nome, cargo, departamento, salario, data_contratacao, cargo_confianca)
VALUES (?, ?, ?, ?, ?, ?)
''', dados)
conn.commit()

In [66]:

# Consultas SQL 


consultas = {
"1": (" Selecionar todos os funcionários que trabalham no TI.",
"SELECT * FROM funcionarios WHERE departamento = 'TI';"),

"2": (" Selecionar os nomes dos funcionários que possuem um salário maior que 5000",
"SELECT nome, salario FROM funcionarios WHERE salario > 5000;"),

"3": (" Selecione o nome e a data de contratação dos funcionários contratados após 01/01/2022.",
"SELECT nome, data_contratacao FROM funcionarios WHERE data_contratacao > '2022-01-01';"),

"4": ("Selecione o departamento e o salário médio de cada departamento.",
"SELECT departamento, ROUND(AVG(salario), 2) AS salario_medio FROM funcionarios GROUP BY departamento;"),

"5": (" Selecione o nome e o cargo dos funcionários que possuem 'da Silva' no nome.",
"SELECT nome, cargo FROM funcionarios WHERE nome LIKE '%da Silva%';"),

"6": (" Selecione todos os funcionários que têm cargos de confiança.",
"SELECT * FROM funcionarios WHERE cargo_confianca = 1;"),

"7": (" Selecione o nome e o departamento dos analistas.",
"SELECT nome, departamento FROM funcionarios WHERE cargo = 'Analista';"),

"8": (" Selecione o nome dos funcionários e seus salários ordenados de forma decrescente.",
"SELECT nome, salario FROM funcionarios ORDER BY salario DESC;"),

"9": (" Selecione o nome e o ID dos funcionários contratados em 2023.",
"SELECT nome, id_funcionario FROM funcionarios WHERE strftime('%Y', data_contratacao) = '2023';"),

"10": (" Selecione o nome dos funcionários do Jurídico com salário <= 3000.",
"SELECT nome FROM funcionarios WHERE departamento = 'Jurídico' AND salario <= 3000;"),

"11": (" Selecione o nome dos funcionários que são Gerentes ou Diretores.",
"SELECT nome, cargo FROM funcionarios WHERE cargo IN ('Gerente', 'Diretor');"),

"12": (" Selecione o nome e os anos de experiência (2025 - ano de contratação).",
"SELECT nome, (2025 - CAST(strftime('%Y', data_contratacao) AS INTEGER)) AS anos_experiencia FROM funcionarios;"),

"13": (" Selecione o nome e o departamento ordenados alfabeticamente.",
"SELECT nome, departamento FROM funcionarios ORDER BY nome ASC;"),

"14": (" Selecione o nome e o cargo dos funcionários cujo nome começa com 'João'.",
"SELECT nome, cargo FROM funcionarios WHERE nome LIKE 'João%';"),

"15": (" Selecione a quantidade de funcionários em cada departamento.",
"SELECT departamento, COUNT(*) AS quantidade_funcionarios FROM funcionarios GROUP BY departamento;")
}

In [67]:

for num, (coment, sql) in consultas.items():
    print(f"\n{num} {coment}")
    df = pd.read_sql_query(sql, conn)
    display(df)

1  Selecionar todos os funcionários que trabalham no TI.

,id_funcionario,nome,cargo,departamento,salario,data_contratacao,cargo_confianca
0,5,Davi de Oliveira,Analista,TI,5000,2022-09-23,0
1,7,Gabriel Cavalcante,Analista,TI,5000,2020-05-09,0
2,9,João David Castro,Coordenador,TI,6000,2024-01-07,1
3,16,Kauan Torres,Técnico,TI,3000,2020-09-03,0
4,17,Lara Pessanha,Analista,TI,5000,2021-11-01,0
5,18,Laura Santos,Técnico,TI,3000,2022-09-01,0
6,22,Nicollas Theodoro,Técnico,TI,3000,2022-04-11,0
7,23,Pedro Henrique Santos,Técnico,TI,3000,2021-06-04,0
8,24,Rayssa da Silva,Diretor,TI,8500,2021-04-07,1
9,25,Rebeca Alves,Analista,TI,5000,2022-11-29,0
10,26,Tábatha Tavares,Técnico,TI,3000,2021-03-21,0
11,27,Vinicius Araujo,Analista,TI,5000,2023-08-07,0
12,28,Yan Tavares,Técnico,TI,3000,2023-06-16,0

2  Selecionar os nomes dos funcionários que possuem um salário maior que 5000

                      nome  salario
0        João David Castro     6000
1     João Miguel da Silva     7500
2      João Paulo de Abreu    15000
3  Jorge Henrique da Silva     8500
4            Lauro Andrade    30000
5          Rayssa da Silva     8500

3  Selecione o nome e a data de contratação dos funcionários contratados após 01/01/2022.

                       nome data_contratacao
0        Alec do Nascimento       2023-03-16
1           Daniel da Silva       2022-12-26
2          Davi de Oliveira       2022-09-23
3              Gabriel Maia       2023-12-19
4                 Igor Cruz       2024-01-14
5         João David Castro       2024-01-07
6   Jorge Henrique da Silva       2022-01-12
7      Karoline de Oliveira       2023-03-15
8              Laura Santos       2022-09-01
9             Lauro Andrade       2022-08-04
10            Miguel Chaves       2022-04-06
11        Nicollas Theodoro       2022-04-11
12             Rebeca Alves       2022-11-29
13          Vinicius Araujo       2023-08-07
14              Yan Tavares       2023-06-16

4 Selecione o departamento e o salário médio de cada departamento.

  departamento  salario_medio
0    Executivo       30000.00
1   Financeiro        5687.50
2     Jurídico        4750.00
3           TI        4423.08

5  Selecione o nome e o cargo dos funcionários que possuem 'da Silva' no nome.

                      nome     cargo
0          Daniel da Silva  Analista
1     João Miguel da Silva   Gerente
2  Jorge Henrique da Silva   Diretor
3         Matheus da Silva  Analista
4          Rayssa da Silva   Diretor

6  Selecione todos os funcionários que têm cargos de confiança.

,id_funcionario,nome,cargo,departamento,salario,data_contratacao,cargo_confianca
0,9,João David Castro,Coordenador,TI,6000,2024-01-07,1
1,10,João Miguel da Silva,Gerente,Jurídico,7500,2021-05-19,1
2,11,João Paulo de Abreu,CFO,Financeiro,15000,2021-12-21,1
3,12,Jorge Henrique da Silva,Diretor,Financeiro,8500,2022-01-12,1
4,19,Lauro Andrade,CEO,Executivo,30000,2022-08-04,1
5,24,Rayssa da Silva,Diretor,TI,8500,2021-04-07,1

7  Selecione o nome e o departamento dos analistas.

                   nome departamento
0          Arthur Assis     Jurídico
1       Daniel da Silva   Financeiro
2      Davi de Oliveira           TI
3    Gabriel Cavalcante           TI
4  Júlia Pereira Santos     Jurídico
5          Kauã Correia     Jurídico
6         Lara Pessanha           TI
7      Matheus da Silva   Financeiro
8          Rebeca Alves           TI
9       Vinicius Araujo           TI

8  Selecione o nome dos funcionários e seus salários ordenados de forma decrescente.

                       nome  salario
0             Lauro Andrade    30000
1       João Paulo de Abreu    15000
2   Jorge Henrique da Silva     8500
3           Rayssa da Silva     8500
4      João Miguel da Silva     7500
5         João David Castro     6000
6              Arthur Assis     5000
7           Daniel da Silva     5000
8          Davi de Oliveira     5000
9        Gabriel Cavalcante     5000
10     Júlia Pereira Santos     5000
11             Kauã Correia     5000
12            Lara Pessanha     5000
13         Matheus da Silva     5000
14             Rebeca Alves     5000
15          Vinicius Araujo     5000
16       Alec do Nascimento     3000
17               Caio Cesar     3000
18             Gabriel Maia     3000
19                Igor Cruz     3000
20     Karoline de Oliveira     3000
21             Kauan Torres     3000
22             Laura Santos     3000
23            Miguel Chaves     3000
24        Nicollas Theodoro     3000
25    Pedro Henrique Santos     3000
26          Tábatha Tavares     3000
27              Yan Tavares     3000

9  Selecione o nome e o ID dos funcionários contratados em 2023.

                   nome  id_funcionario
0    Alec do Nascimento               1
1          Gabriel Maia               6
2  Karoline de Oliveira              14
3       Vinicius Araujo              27
4           Yan Tavares              28

10  Selecione o nome dos funcionários do Jurídico com salário <= 3000.

                   nome
0    Alec do Nascimento
1  Karoline de Oliveira

11  Selecione o nome dos funcionários que são Gerentes ou Diretores.

                      nome    cargo
0     João Miguel da Silva  Gerente
1  Jorge Henrique da Silva  Diretor
2          Rayssa da Silva  Diretor

12  Selecione o nome e os anos de experiência (2025 - ano de contratação).

                       nome  anos_experiencia
0        Alec do Nascimento                 2
1              Arthur Assis                 5
2                Caio Cesar                 4
3           Daniel da Silva                 3
4          Davi de Oliveira                 3
5              Gabriel Maia                 2
6        Gabriel Cavalcante                 5
7                 Igor Cruz                 1
8         João David Castro                 1
9      João Miguel da Silva                 4
10      João Paulo de Abreu                 4
11  Jorge Henrique da Silva                 3
12     Júlia Pereira Santos                 5
13     Karoline de Oliveira                 2
14             Kauã Correia                 5
15             Kauan Torres                 5
16            Lara Pessanha                 4
17             Laura Santos                 3
18            Lauro Andrade                 3
19         Matheus da Silva                 5
20            Miguel Chaves                 3
21        Nicollas Theodoro                 3
22    Pedro Henrique Santos                 4
23          Rayssa da Silva                 4
24             Rebeca Alves                 3
25          Tábatha Tavares                 4
26          Vinicius Araujo                 2
27              Yan Tavares                 2

13  Selecione o nome e o departamento ordenados alfabeticamente.

                       nome departamento
0        Alec do Nascimento     Jurídico
1              Arthur Assis     Jurídico
2                Caio Cesar   Financeiro
3           Daniel da Silva   Financeiro
4          Davi de Oliveira           TI
5        Gabriel Cavalcante           TI
6              Gabriel Maia   Financeiro
7                 Igor Cruz   Financeiro
8   Jorge Henrique da Silva   Financeiro
9         João David Castro           TI
10     João Miguel da Silva     Jurídico
11      João Paulo de Abreu   Financeiro
12     Júlia Pereira Santos     Jurídico
13     Karoline de Oliveira     Jurídico
14             Kauan Torres           TI
15             Kauã Correia     Jurídico
16            Lara Pessanha           TI
17             Laura Santos           TI
18            Lauro Andrade    Executivo
19         Matheus da Silva   Financeiro
20            Miguel Chaves   Financeiro
21        Nicollas Theodoro           TI
22    Pedro Henrique Santos           TI
23          Rayssa da Silva           TI
24             Rebeca Alves           TI
25          Tábatha Tavares           TI
26          Vinicius Araujo           TI
27              Yan Tavares           TI

14  Selecione o nome e o cargo dos funcionários cujo nome começa com 'João'.

                   nome        cargo
0     João David Castro  Coordenador
1  João Miguel da Silva      Gerente
2   João Paulo de Abreu          CFO

15  Selecione a quantidade de funcionários em cada departamento.

  departamento  quantidade_funcionarios
0    Executivo                        1
1   Financeiro                        8
2     Jurídico                        6
3           TI                       13